name: "VGGNET_TEXT_scene_text_512x512_deploy"
input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 512
  dim: 512
}
layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "data"
  top: "conv1_1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "relu1_1"
  type: "ReLU"
  bottom: "conv1_1"
  top: "conv1_1"
}
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "conv1_1"
  top: "conv1_2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "relu1_2"
  type: "ReLU"
  bottom: "conv1_2"
  top: "conv1_2"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_2"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "relu2_1"
  type: "ReLU"
  bottom: "conv2_1"
  top: "conv2_1"
}
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "conv2_1"
  top: "conv2_2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "relu2_2"
  type: "ReLU"
  bottom: "conv2_2"
  top: "conv2_2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2_2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "relu3_1"
  type: "ReLU"
  bottom: "conv3_1"
  top: "conv3_1"
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "conv3_1"
  top: "conv3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "conv3_2"
  top: "conv3_3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "conv3_3"
  top: "conv3_3"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3_3"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "relu4_1"
  type: "ReLU"
  bottom: "conv4_1"
  top: "conv4_1"
}
layer {
  name: "conv4_2"
  type: "Convolution"
  bottom: "conv4_1"
  top: "conv4_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "relu4_2"
  type: "ReLU"
  bottom: "conv4_2"
  top: "conv4_2"
}
layer {
  name: "conv4_3"
  type: "Convolution"
  bottom: "conv4_2"
  top: "conv4_3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "relu4_3"
  type: "ReLU"
  bottom: "conv4_3"
  top: "conv4_3"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv4_3"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv5_1"
  type: "Convolution"
  bottom: "pool4"
  top: "conv5_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_1"
  type: "ReLU"
  bottom: "conv5_1"
  top: "conv5_1"
}
layer {
  name: "conv5_2"
  type: "Convolution"
  bottom: "conv5_1"
  top: "conv5_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_2"
  type: "ReLU"
  bottom: "conv5_2"
  top: "conv5_2"
}
layer {
  name: "conv5_3"
  type: "Convolution"
  bottom: "conv5_2"
  top: "conv5_3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_3"
  type: "ReLU"
  bottom: "conv5_3"
  top: "conv5_3"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5_3"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "fc6"
  type: "Convolution"
  bottom: "pool5"
  top: "fc6"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1024
    pad: 6
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    dilation: 6
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "fc7"
  type: "Convolution"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "Conv6_1"
  type: "Convolution"
  bottom: "fc7"
  top: "Conv6_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "Conv6_1_relu"
  type: "ReLU"
  bottom: "Conv6_1"
  top: "Conv6_1"
}
layer {
  name: "Conv6_2_reduction"
  type: "Convolution"
  bottom: "Conv6_1"
  top: "Conv6_2_reduction"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "Conv6_2_reduction_relu"
  type: "ReLU"
  bottom: "Conv6_2_reduction"
  top: "Conv6_2_reduction"
}
layer {
  name: "Conv6_2_3x3"
  type: "Convolution"
  bottom: "Conv6_1"
  top: "Conv6_2_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    dilation: 2
  }
}
layer {
  name: "Conv6_2_3x3_relu"
  type: "ReLU"
  bottom: "Conv6_2_3x3"
  top: "Conv6_2_3x3"
}
layer {
  name: "Conv6_2_3x3_pool"
  type: "Pooling"
  bottom: "Conv6_1"
  top: "Conv6_2_3x3_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "Conv6_2_1x1"
  type: "Convolution"
  bottom: "Conv6_2_3x3_pool"
  top: "Conv6_2_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "Conv6_2_1x1_relu"
  type: "ReLU"
  bottom: "Conv6_2_1x1"
  top: "Conv6_2_1x1"
}
layer {
  name: "Conv6_2_1x5"
  type: "Convolution"
  bottom: "Conv6_1"
  top: "Conv6_2_1x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 2
    kernel_h: 1
    kernel_w: 5
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "Conv6_2_1x5_relu"
  type: "ReLU"
  bottom: "Conv6_2_1x5"
  top: "Conv6_2_1x5"
}
layer {
  name: "Conv6_2_5x1"
  type: "Convolution"
  bottom: "Conv6_2_1x5"
  top: "Conv6_2_5x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 2
    pad_w: 0
    kernel_h: 5
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "Conv6_2_5x1_relu"
  type: "ReLU"
  bottom: "Conv6_2_5x1"
  top: "Conv6_2_5x1"
}
layer {
  name: "Conv6_2"
  type: "Concat"
  bottom: "Conv6_2_reduction"
  bottom: "Conv6_2_3x3"
  bottom: "Conv6_2_1x1"
  bottom: "Conv6_2_5x1"
  top: "Conv6_2"
}
layer {
  name: "Conv7_1"
  type: "Convolution"
  bottom: "Conv6_2"
  top: "Conv7_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "Conv7_1_relu"
  type: "ReLU"
  bottom: "Conv7_1"
  top: "Conv7_1"
}
layer {
  name: "Conv7_2_reduction"
  type: "Convolution"
  bottom: "Conv7_1"
  top: "Conv7_2_reduction"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "Conv7_2_reduction_relu"
  type: "ReLU"
  bottom: "Conv7_2_reduction"
  top: "Conv7_2_reduction"
}
layer {
  name: "Conv7_2_3x3"
  type: "Convolution"
  bottom: "Conv7_1"
  top: "Conv7_2_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    dilation: 2
  }
}
layer {
  name: "Conv7_2_3x3_relu"
  type: "ReLU"
  bottom: "Conv7_2_3x3"
  top: "Conv7_2_3x3"
}
layer {
  name: "Conv7_2_3x3_pool"
  type: "Pooling"
  bottom: "Conv7_1"
  top: "Conv7_2_3x3_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "Conv7_2_1x1"
  type: "Convolution"
  bottom: "Conv7_2_3x3_pool"
  top: "Conv7_2_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "Conv7_2_1x1_relu"
  type: "ReLU"
  bottom: "Conv7_2_1x1"
  top: "Conv7_2_1x1"
}
layer {
  name: "Conv7_2_1x5"
  type: "Convolution"
  bottom: "Conv7_1"
  top: "Conv7_2_1x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 2
    kernel_h: 1
    kernel_w: 5
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "Conv7_2_1x5_relu"
  type: "ReLU"
  bottom: "Conv7_2_1x5"
  top: "Conv7_2_1x5"
}
layer {
  name: "Conv7_2_5x1"
  type: "Convolution"
  bottom: "Conv7_2_1x5"
  top: "Conv7_2_5x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 2
    pad_w: 0
    kernel_h: 5
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "Conv7_2_5x1_relu"
  type: "ReLU"
  bottom: "Conv7_2_5x1"
  top: "Conv7_2_5x1"
}
layer {
  name: "Conv7_2"
  type: "Concat"
  bottom: "Conv7_2_reduction"
  bottom: "Conv7_2_3x3"
  bottom: "Conv7_2_1x1"
  bottom: "Conv7_2_5x1"
  top: "Conv7_2"
}
layer {
  name: "Conv8_1"
  type: "Convolution"
  bottom: "Conv7_2"
  top: "Conv8_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "Conv8_1_relu"
  type: "ReLU"
  bottom: "Conv8_1"
  top: "Conv8_1"
}
layer {
  name: "Conv8_2_reduction"
  type: "Convolution"
  bottom: "Conv8_1"
  top: "Conv8_2_reduction"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "Conv8_2_reduction_relu"
  type: "ReLU"
  bottom: "Conv8_2_reduction"
  top: "Conv8_2_reduction"
}
layer {
  name: "Conv8_2_3x3"
  type: "Convolution"
  bottom: "Conv8_1"
  top: "Conv8_2_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    dilation: 2
  }
}
layer {
  name: "Conv8_2_3x3_relu"
  type: "ReLU"
  bottom: "Conv8_2_3x3"
  top: "Conv8_2_3x3"
}
layer {
  name: "Conv8_2_3x3_pool"
  type: "Pooling"
  bottom: "Conv8_1"
  top: "Conv8_2_3x3_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "Conv8_2_1x1"
  type: "Convolution"
  bottom: "Conv8_2_3x3_pool"
  top: "Conv8_2_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "Conv8_2_1x1_relu"
  type: "ReLU"
  bottom: "Conv8_2_1x1"
  top: "Conv8_2_1x1"
}
layer {
  name: "Conv8_2_1x5"
  type: "Convolution"
  bottom: "Conv8_1"
  top: "Conv8_2_1x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 2
    kernel_h: 1
    kernel_w: 5
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "Conv8_2_1x5_relu"
  type: "ReLU"
  bottom: "Conv8_2_1x5"
  top: "Conv8_2_1x5"
}
layer {
  name: "Conv8_2_5x1"
  type: "Convolution"
  bottom: "Conv8_2_1x5"
  top: "Conv8_2_5x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 2
    pad_w: 0
    kernel_h: 5
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "Conv8_2_5x1_relu"
  type: "ReLU"
  bottom: "Conv8_2_5x1"
  top: "Conv8_2_5x1"
}
layer {
  name: "Conv8_2"
  type: "Concat"
  bottom: "Conv8_2_reduction"
  bottom: "Conv8_2_3x3"
  bottom: "Conv8_2_1x1"
  bottom: "Conv8_2_5x1"
  top: "Conv8_2"
}
layer {
  name: "Conv9_1"
  type: "Convolution"
  bottom: "Conv8_2"
  top: "Conv9_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "Conv9_1_relu"
  type: "ReLU"
  bottom: "Conv9_1"
  top: "Conv9_1"
}
layer {
  name: "Conv9_2_reduction"
  type: "Convolution"
  bottom: "Conv9_1"
  top: "Conv9_2_reduction"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "Conv9_2_reduction_relu"
  type: "ReLU"
  bottom: "Conv9_2_reduction"
  top: "Conv9_2_reduction"
}
layer {
  name: "Conv9_2_3x3"
  type: "Convolution"
  bottom: "Conv9_1"
  top: "Conv9_2_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    dilation: 2
  }
}
layer {
  name: "Conv9_2_3x3_relu"
  type: "ReLU"
  bottom: "Conv9_2_3x3"
  top: "Conv9_2_3x3"
}
layer {
  name: "Conv9_2_3x3_pool"
  type: "Pooling"
  bottom: "Conv9_1"
  top: "Conv9_2_3x3_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "Conv9_2_1x1"
  type: "Convolution"
  bottom: "Conv9_2_3x3_pool"
  top: "Conv9_2_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "Conv9_2_1x1_relu"
  type: "ReLU"
  bottom: "Conv9_2_1x1"
  top: "Conv9_2_1x1"
}
layer {
  name: "Conv9_2_1x5"
  type: "Convolution"
  bottom: "Conv9_1"
  top: "Conv9_2_1x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 2
    kernel_h: 1
    kernel_w: 5
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "Conv9_2_1x5_relu"
  type: "ReLU"
  bottom: "Conv9_2_1x5"
  top: "Conv9_2_1x5"
}
layer {
  name: "Conv9_2_5x1"
  type: "Convolution"
  bottom: "Conv9_2_1x5"
  top: "Conv9_2_5x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 2
    pad_w: 0
    kernel_h: 5
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "Conv9_2_5x1_relu"
  type: "ReLU"
  bottom: "Conv9_2_5x1"
  top: "Conv9_2_5x1"
}
layer {
  name: "Conv9_2"
  type: "Concat"
  bottom: "Conv9_2_reduction"
  bottom: "Conv9_2_3x3"
  bottom: "Conv9_2_1x1"
  bottom: "Conv9_2_5x1"
  top: "Conv9_2"
}
layer {
  name: "Conv10_1"
  type: "Convolution"
  bottom: "Conv9_2"
  top: "Conv10_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "Conv10_1_relu"
  type: "ReLU"
  bottom: "Conv10_1"
  top: "Conv10_1"
}
layer {
  name: "Conv10_2_reduction"
  type: "Convolution"
  bottom: "Conv10_1"
  top: "Conv10_2_reduction"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "Conv10_2_reduction_relu"
  type: "ReLU"
  bottom: "Conv10_2_reduction"
  top: "Conv10_2_reduction"
}
layer {
  name: "Conv10_2_3x3"
  type: "Convolution"
  bottom: "Conv10_1"
  top: "Conv10_2_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    dilation: 2
  }
}
layer {
  name: "Conv10_2_3x3_relu"
  type: "ReLU"
  bottom: "Conv10_2_3x3"
  top: "Conv10_2_3x3"
}
layer {
  name: "Conv10_2_3x3_pool"
  type: "Pooling"
  bottom: "Conv10_1"
  top: "Conv10_2_3x3_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "Conv10_2_1x1"
  type: "Convolution"
  bottom: "Conv10_2_3x3_pool"
  top: "Conv10_2_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "Conv10_2_1x1_relu"
  type: "ReLU"
  bottom: "Conv10_2_1x1"
  top: "Conv10_2_1x1"
}
layer {
  name: "Conv10_2_1x5"
  type: "Convolution"
  bottom: "Conv10_1"
  top: "Conv10_2_1x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 2
    kernel_h: 1
    kernel_w: 5
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "Conv10_2_1x5_relu"
  type: "ReLU"
  bottom: "Conv10_2_1x5"
  top: "Conv10_2_1x5"
}
layer {
  name: "Conv10_2_5x1"
  type: "Convolution"
  bottom: "Conv10_2_1x5"
  top: "Conv10_2_5x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 2
    pad_w: 0
    kernel_h: 5
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "Conv10_2_5x1_relu"
  type: "ReLU"
  bottom: "Conv10_2_5x1"
  top: "Conv10_2_5x1"
}
layer {
  name: "Conv10_2"
  type: "Concat"
  bottom: "Conv10_2_reduction"
  bottom: "Conv10_2_3x3"
  bottom: "Conv10_2_1x1"
  bottom: "Conv10_2_5x1"
  top: "Conv10_2"
}
layer {
  name: "conv3_3_inception_reduction"
  type: "Convolution"
  bottom: "conv3_3"
  top: "conv3_3_inception_reduction"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "conv3_3_inception_reduction_bn"
  type: "BatchNorm"
  bottom: "conv3_3_inception_reduction"
  top: "conv3_3_inception_reduction"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: false
    eps: 0.0010000000475
  }
}
layer {
  name: "conv3_3_inception_reduction_scale"
  type: "Scale"
  bottom: "conv3_3_inception_reduction"
  top: "conv3_3_inception_reduction"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv3_3_inception_reduction_relu"
  type: "ReLU"
  bottom: "conv3_3_inception_reduction"
  top: "conv3_3_inception_reduction"
}
layer {
  name: "conv3_3_inception_3x3"
  type: "Convolution"
  bottom: "conv3_3"
  top: "conv3_3_inception_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 2
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    dilation: 2
  }
}
layer {
  name: "conv3_3_inception_3x3_bn"
  type: "BatchNorm"
  bottom: "conv3_3_inception_3x3"
  top: "conv3_3_inception_3x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: false
    eps: 0.0010000000475
  }
}
layer {
  name: "conv3_3_inception_3x3_scale"
  type: "Scale"
  bottom: "conv3_3_inception_3x3"
  top: "conv3_3_inception_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv3_3_inception_3x3_relu"
  type: "ReLU"
  bottom: "conv3_3_inception_3x3"
  top: "conv3_3_inception_3x3"
}
layer {
  name: "conv3_3_inception_3x3_pool"
  type: "Pooling"
  bottom: "conv3_3"
  top: "conv3_3_inception_3x3_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "conv3_3_inception_1x1"
  type: "Convolution"
  bottom: "conv3_3_inception_3x3_pool"
  top: "conv3_3_inception_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "conv3_3_inception_1x1_bn"
  type: "BatchNorm"
  bottom: "conv3_3_inception_1x1"
  top: "conv3_3_inception_1x1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: false
    eps: 0.0010000000475
  }
}
layer {
  name: "conv3_3_inception_1x1_scale"
  type: "Scale"
  bottom: "conv3_3_inception_1x1"
  top: "conv3_3_inception_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv3_3_inception_1x1_relu"
  type: "ReLU"
  bottom: "conv3_3_inception_1x1"
  top: "conv3_3_inception_1x1"
}
layer {
  name: "conv3_3_inception_1x5"
  type: "Convolution"
  bottom: "conv3_3"
  top: "conv3_3_inception_1x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    pad_h: 0
    pad_w: 4
    kernel_h: 1
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 2
  }
}
layer {
  name: "conv3_3_inception_1x5_bn"
  type: "BatchNorm"
  bottom: "conv3_3_inception_1x5"
  top: "conv3_3_inception_1x5"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.999000012875
    eps: 0.0010000000475
  }
}
layer {
  name: "conv3_3_inception_1x5_scale"
  type: "Scale"
  bottom: "conv3_3_inception_1x5"
  top: "conv3_3_inception_1x5"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv3_3_inception_1x5_relu"
  type: "ReLU"
  bottom: "conv3_3_inception_1x5"
  top: "conv3_3_inception_1x5"
}
layer {
  name: "conv3_3_inception_5x1"
  type: "Convolution"
  bottom: "conv3_3_inception_1x5"
  top: "conv3_3_inception_5x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    pad_h: 4
    pad_w: 0
    kernel_h: 5
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 2
  }
}
layer {
  name: "conv3_3_inception_5x1_bn"
  type: "BatchNorm"
  bottom: "conv3_3_inception_5x1"
  top: "conv3_3_inception_5x1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.999000012875
    eps: 0.0010000000475
  }
}
layer {
  name: "conv3_3_inception_5x1_scale"
  type: "Scale"
  bottom: "conv3_3_inception_5x1"
  top: "conv3_3_inception_5x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv3_3_inception_5x1_relu"
  type: "ReLU"
  bottom: "conv3_3_inception_5x1"
  top: "conv3_3_inception_5x1"
}
layer {
  name: "conv3_3_inception"
  type: "Concat"
  bottom: "conv3_3_inception_reduction"
  bottom: "conv3_3_inception_3x3"
  bottom: "conv3_3_inception_1x1"
  bottom: "conv3_3_inception_5x1"
  top: "conv3_3_inception"
}
layer {
  name: "conv3_3_downsample"
  type: "Pooling"
  bottom: "conv3_3_inception"
  top: "conv3_3_downsample"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4_3_inception_reduction"
  type: "Convolution"
  bottom: "conv4_3"
  top: "conv4_3_inception_reduction"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "conv4_3_inception_reduction_bn"
  type: "BatchNorm"
  bottom: "conv4_3_inception_reduction"
  top: "conv4_3_inception_reduction"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: false
    eps: 0.0010000000475
  }
}
layer {
  name: "conv4_3_inception_reduction_scale"
  type: "Scale"
  bottom: "conv4_3_inception_reduction"
  top: "conv4_3_inception_reduction"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv4_3_inception_reduction_relu"
  type: "ReLU"
  bottom: "conv4_3_inception_reduction"
  top: "conv4_3_inception_reduction"
}
layer {
  name: "conv4_3_inception_3x3"
  type: "Convolution"
  bottom: "conv4_3"
  top: "conv4_3_inception_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 2
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    dilation: 2
  }
}
layer {
  name: "conv4_3_inception_3x3_bn"
  type: "BatchNorm"
  bottom: "conv4_3_inception_3x3"
  top: "conv4_3_inception_3x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: false
    eps: 0.0010000000475
  }
}
layer {
  name: "conv4_3_inception_3x3_scale"
  type: "Scale"
  bottom: "conv4_3_inception_3x3"
  top: "conv4_3_inception_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv4_3_inception_3x3_relu"
  type: "ReLU"
  bottom: "conv4_3_inception_3x3"
  top: "conv4_3_inception_3x3"
}
layer {
  name: "conv4_3_inception_3x3_pool"
  type: "Pooling"
  bottom: "conv4_3"
  top: "conv4_3_inception_3x3_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "conv4_3_inception_1x1"
  type: "Convolution"
  bottom: "conv4_3_inception_3x3_pool"
  top: "conv4_3_inception_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "conv4_3_inception_1x1_bn"
  type: "BatchNorm"
  bottom: "conv4_3_inception_1x1"
  top: "conv4_3_inception_1x1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: false
    eps: 0.0010000000475
  }
}
layer {
  name: "conv4_3_inception_1x1_scale"
  type: "Scale"
  bottom: "conv4_3_inception_1x1"
  top: "conv4_3_inception_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv4_3_inception_1x1_relu"
  type: "ReLU"
  bottom: "conv4_3_inception_1x1"
  top: "conv4_3_inception_1x1"
}
layer {
  name: "conv4_3_inception_1x5"
  type: "Convolution"
  bottom: "conv4_3"
  top: "conv4_3_inception_1x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    pad_h: 0
    pad_w: 4
    kernel_h: 1
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 2
  }
}
layer {
  name: "conv4_3_inception_1x5_bn"
  type: "BatchNorm"
  bottom: "conv4_3_inception_1x5"
  top: "conv4_3_inception_1x5"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.999000012875
    eps: 0.0010000000475
  }
}
layer {
  name: "conv4_3_inception_1x5_scale"
  type: "Scale"
  bottom: "conv4_3_inception_1x5"
  top: "conv4_3_inception_1x5"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv4_3_inception_1x5_relu"
  type: "ReLU"
  bottom: "conv4_3_inception_1x5"
  top: "conv4_3_inception_1x5"
}
layer {
  name: "conv4_3_inception_5x1"
  type: "Convolution"
  bottom: "conv4_3_inception_1x5"
  top: "conv4_3_inception_5x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    pad_h: 4
    pad_w: 0
    kernel_h: 5
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 2
  }
}
layer {
  name: "conv4_3_inception_5x1_bn"
  type: "BatchNorm"
  bottom: "conv4_3_inception_5x1"
  top: "conv4_3_inception_5x1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.999000012875
    eps: 0.0010000000475
  }
}
layer {
  name: "conv4_3_inception_5x1_scale"
  type: "Scale"
  bottom: "conv4_3_inception_5x1"
  top: "conv4_3_inception_5x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv4_3_inception_5x1_relu"
  type: "ReLU"
  bottom: "conv4_3_inception_5x1"
  top: "conv4_3_inception_5x1"
}
layer {
  name: "conv4_3_inception"
  type: "Concat"
  bottom: "conv4_3_inception_reduction"
  bottom: "conv4_3_inception_3x3"
  bottom: "conv4_3_inception_1x1"
  bottom: "conv4_3_inception_5x1"
  top: "conv4_3_inception"
}
layer {
  name: "conv4_3_downsample"
  type: "Pooling"
  bottom: "conv4_3_inception"
  top: "conv4_3_downsample"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fc7_inception_reduction"
  type: "Convolution"
  bottom: "fc7"
  top: "fc7_inception_reduction"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "fc7_inception_reduction_bn"
  type: "BatchNorm"
  bottom: "fc7_inception_reduction"
  top: "fc7_inception_reduction"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: false
    eps: 0.0010000000475
  }
}
layer {
  name: "fc7_inception_reduction_scale"
  type: "Scale"
  bottom: "fc7_inception_reduction"
  top: "fc7_inception_reduction"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "fc7_inception_reduction_relu"
  type: "ReLU"
  bottom: "fc7_inception_reduction"
  top: "fc7_inception_reduction"
}
layer {
  name: "fc7_inception_3x3"
  type: "Convolution"
  bottom: "fc7"
  top: "fc7_inception_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 2
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    dilation: 2
  }
}
layer {
  name: "fc7_inception_3x3_bn"
  type: "BatchNorm"
  bottom: "fc7_inception_3x3"
  top: "fc7_inception_3x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: false
    eps: 0.0010000000475
  }
}
layer {
  name: "fc7_inception_3x3_scale"
  type: "Scale"
  bottom: "fc7_inception_3x3"
  top: "fc7_inception_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "fc7_inception_3x3_relu"
  type: "ReLU"
  bottom: "fc7_inception_3x3"
  top: "fc7_inception_3x3"
}
layer {
  name: "fc7_inception_3x3_pool"
  type: "Pooling"
  bottom: "fc7"
  top: "fc7_inception_3x3_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "fc7_inception_1x1"
  type: "Convolution"
  bottom: "fc7_inception_3x3_pool"
  top: "fc7_inception_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "fc7_inception_1x1_bn"
  type: "BatchNorm"
  bottom: "fc7_inception_1x1"
  top: "fc7_inception_1x1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: false
    eps: 0.0010000000475
  }
}
layer {
  name: "fc7_inception_1x1_scale"
  type: "Scale"
  bottom: "fc7_inception_1x1"
  top: "fc7_inception_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "fc7_inception_1x1_relu"
  type: "ReLU"
  bottom: "fc7_inception_1x1"
  top: "fc7_inception_1x1"
}
layer {
  name: "fc7_inception_1x5"
  type: "Convolution"
  bottom: "fc7"
  top: "fc7_inception_1x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    pad_h: 0
    pad_w: 4
    kernel_h: 1
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 2
  }
}
layer {
  name: "fc7_inception_1x5_bn"
  type: "BatchNorm"
  bottom: "fc7_inception_1x5"
  top: "fc7_inception_1x5"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.999000012875
    eps: 0.0010000000475
  }
}
layer {
  name: "fc7_inception_1x5_scale"
  type: "Scale"
  bottom: "fc7_inception_1x5"
  top: "fc7_inception_1x5"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "fc7_inception_1x5_relu"
  type: "ReLU"
  bottom: "fc7_inception_1x5"
  top: "fc7_inception_1x5"
}
layer {
  name: "fc7_inception_5x1"
  type: "Convolution"
  bottom: "fc7_inception_1x5"
  top: "fc7_inception_5x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    pad_h: 4
    pad_w: 0
    kernel_h: 5
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 2
  }
}
layer {
  name: "fc7_inception_5x1_bn"
  type: "BatchNorm"
  bottom: "fc7_inception_5x1"
  top: "fc7_inception_5x1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.999000012875
    eps: 0.0010000000475
  }
}
layer {
  name: "fc7_inception_5x1_scale"
  type: "Scale"
  bottom: "fc7_inception_5x1"
  top: "fc7_inception_5x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "fc7_inception_5x1_relu"
  type: "ReLU"
  bottom: "fc7_inception_5x1"
  top: "fc7_inception_5x1"
}
layer {
  name: "fc7_inception"
  type: "Concat"
  bottom: "fc7_inception_reduction"
  bottom: "fc7_inception_3x3"
  bottom: "fc7_inception_1x1"
  bottom: "fc7_inception_5x1"
  top: "fc7_inception"
}
layer {
  name: "fc7_downsample"
  type: "Pooling"
  bottom: "fc7_inception"
  top: "fc7_downsample"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fc7_upsample"
  type: "Deconvolution"
  bottom: "fc7_inception"
  top: "fc7_upsample"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 4
    group: 64
    stride: 2
    weight_filler {
      type: "bilinear"
    }
  }
}
layer {
  name: "Conv6_2_upsample"
  type: "Deconvolution"
  bottom: "Conv6_2"
  top: "Conv6_2_upsample"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 4
    group: 64
    stride: 2
    weight_filler {
      type: "bilinear"
    }
  }
}
layer {
  name: "Conv7_2_upsample"
  type: "Deconvolution"
  bottom: "Conv7_2"
  top: "Conv7_2_upsample"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 4
    group: 64
    stride: 2
    weight_filler {
      type: "bilinear"
    }
  }
}
layer {
  name: "conv4_3_concat_mask"
  type: "Eltwise"
  bottom: "fc7_upsample"
  bottom: "conv4_3_inception"
  bottom: "conv3_3_downsample"
  top: "conv4_3_concat_mask"
}
layer {
  name: "conv4_3_conv_reduce"
  type: "Convolution"
  bottom: "conv4_3_concat_mask"
  top: "conv4_3_conv_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 2
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    dilation: 2
  }
}
layer {
  name: "conv4_3_conv_reduce_bn"
  type: "BatchNorm"
  bottom: "conv4_3_conv_reduce"
  top: "conv4_3_conv_reduce"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: false
    eps: 0.0010000000475
  }
}
layer {
  name: "conv4_3_conv_reduce_scale"
  type: "Scale"
  bottom: "conv4_3_conv_reduce"
  top: "conv4_3_conv_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv4_3_conv_reduce_relu"
  type: "ReLU"
  bottom: "conv4_3_conv_reduce"
  top: "conv4_3_conv_reduce"
}
layer {
  name: "conv4_3_resize"
  type: "Deconvolution"
  bottom: "conv4_3_conv_reduce"
  top: "conv4_3_resize"
  convolution_param {
    num_output: 2
    bias_term: false
    pad: 4
    kernel_size: 16
    group: 2
    stride: 8
    weight_filler {
      type: "bilinear"
    }
  }
}
layer {
  name: "conv4_3_conv_3x3_"
  type: "Convolution"
  bottom: "conv4_3_resize"
  top: "conv4_3_conv_3x3_"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 2
    bias_term: false
    pad: 2
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    dilation: 2
  }
}
layer {
  name: "conv4_3_conv_3x3__bn"
  type: "BatchNorm"
  bottom: "conv4_3_conv_3x3_"
  top: "conv4_3_conv_3x3_"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: false
    eps: 0.0010000000475
  }
}
layer {
  name: "conv4_3_conv_3x3__scale"
  type: "Scale"
  bottom: "conv4_3_conv_3x3_"
  top: "conv4_3_conv_3x3_"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv4_3_conv_3x3__relu"
  type: "ReLU"
  bottom: "conv4_3_conv_3x3_"
  top: "conv4_3_conv_3x3_"
}
layer {
  name: "conv4_3_conv_3x3_1"
  type: "Convolution"
  bottom: "conv4_3_conv_3x3_"
  top: "conv4_3_conv_3x3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
